ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/CONTROLSS_INPUTXBAR_CONTROLSS_502D0000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_INPUTXBAR0_GSEL" acronym="CONTROLSS_INPUTXBAR0_GSEL" offset="256" width="32" description="INPUT XBAR0 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR0_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR0_G0" acronym="CONTROLSS_INPUTXBAR0_G0" offset="260" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR0_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR0_G1" acronym="CONTROLSS_INPUTXBAR0_G1" offset="264" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR0_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR1_GSEL" acronym="CONTROLSS_INPUTXBAR1_GSEL" offset="320" width="32" description="INPUT XBAR1 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR1_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR1_G0" acronym="CONTROLSS_INPUTXBAR1_G0" offset="324" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR1_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR1_G1" acronym="CONTROLSS_INPUTXBAR1_G1" offset="328" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR1_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR2_GSEL" acronym="CONTROLSS_INPUTXBAR2_GSEL" offset="384" width="32" description="INPUT XBAR2 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR2_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR2_G0" acronym="CONTROLSS_INPUTXBAR2_G0" offset="388" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR2_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR2_G1" acronym="CONTROLSS_INPUTXBAR2_G1" offset="392" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR2_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR3_GSEL" acronym="CONTROLSS_INPUTXBAR3_GSEL" offset="448" width="32" description="INPUT XBAR3 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR3_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR3_G0" acronym="CONTROLSS_INPUTXBAR3_G0" offset="452" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR3_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR3_G1" acronym="CONTROLSS_INPUTXBAR3_G1" offset="456" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR3_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR4_GSEL" acronym="CONTROLSS_INPUTXBAR4_GSEL" offset="512" width="32" description="INPUT XBAR4 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR4_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR4_G0" acronym="CONTROLSS_INPUTXBAR4_G0" offset="516" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR4_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR4_G1" acronym="CONTROLSS_INPUTXBAR4_G1" offset="520" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR4_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR5_GSEL" acronym="CONTROLSS_INPUTXBAR5_GSEL" offset="576" width="32" description="INPUT XBAR5 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR5_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR5_G0" acronym="CONTROLSS_INPUTXBAR5_G0" offset="580" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR5_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR5_G1" acronym="CONTROLSS_INPUTXBAR5_G1" offset="584" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR5_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR6_GSEL" acronym="CONTROLSS_INPUTXBAR6_GSEL" offset="640" width="32" description="INPUT XBAR6 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR6_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR6_G0" acronym="CONTROLSS_INPUTXBAR6_G0" offset="644" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR6_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR6_G1" acronym="CONTROLSS_INPUTXBAR6_G1" offset="648" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR6_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR7_GSEL" acronym="CONTROLSS_INPUTXBAR7_GSEL" offset="704" width="32" description="INPUT XBAR7 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR7_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR7_G0" acronym="CONTROLSS_INPUTXBAR7_G0" offset="708" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR7_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR7_G1" acronym="CONTROLSS_INPUTXBAR7_G1" offset="712" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR7_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR8_GSEL" acronym="CONTROLSS_INPUTXBAR8_GSEL" offset="768" width="32" description="INPUT XBAR8 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR8_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR8_G0" acronym="CONTROLSS_INPUTXBAR8_G0" offset="772" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR8_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR8_G1" acronym="CONTROLSS_INPUTXBAR8_G1" offset="776" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR8_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR9_GSEL" acronym="CONTROLSS_INPUTXBAR9_GSEL" offset="832" width="32" description="INPUT XBAR9 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR9_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR9_G0" acronym="CONTROLSS_INPUTXBAR9_G0" offset="836" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR9_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR9_G1" acronym="CONTROLSS_INPUTXBAR9_G1" offset="840" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR9_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR10_GSEL" acronym="CONTROLSS_INPUTXBAR10_GSEL" offset="896" width="32" description="INPUT XBAR10 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR10_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR10_G0" acronym="CONTROLSS_INPUTXBAR10_G0" offset="900" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR10_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR10_G1" acronym="CONTROLSS_INPUTXBAR10_G1" offset="904" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR10_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR11_GSEL" acronym="CONTROLSS_INPUTXBAR11_GSEL" offset="960" width="32" description="INPUT XBAR11 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR11_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR11_G0" acronym="CONTROLSS_INPUTXBAR11_G0" offset="964" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR11_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR11_G1" acronym="CONTROLSS_INPUTXBAR11_G1" offset="968" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR11_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR12_GSEL" acronym="CONTROLSS_INPUTXBAR12_GSEL" offset="1024" width="32" description="INPUT XBAR12 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR12_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR12_G0" acronym="CONTROLSS_INPUTXBAR12_G0" offset="1028" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR12_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR12_G1" acronym="CONTROLSS_INPUTXBAR12_G1" offset="1032" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR12_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR13_GSEL" acronym="CONTROLSS_INPUTXBAR13_GSEL" offset="1088" width="32" description="INPUT XBAR13 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR13_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR13_G0" acronym="CONTROLSS_INPUTXBAR13_G0" offset="1092" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR13_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR13_G1" acronym="CONTROLSS_INPUTXBAR13_G1" offset="1096" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR13_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR14_GSEL" acronym="CONTROLSS_INPUTXBAR14_GSEL" offset="1152" width="32" description="INPUT XBAR14 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR14_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR14_G0" acronym="CONTROLSS_INPUTXBAR14_G0" offset="1156" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR14_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR14_G1" acronym="CONTROLSS_INPUTXBAR14_G1" offset="1160" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR14_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR15_GSEL" acronym="CONTROLSS_INPUTXBAR15_GSEL" offset="1216" width="32" description="INPUT XBAR15 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR15_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR15_G0" acronym="CONTROLSS_INPUTXBAR15_G0" offset="1220" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR15_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR15_G1" acronym="CONTROLSS_INPUTXBAR15_G1" offset="1224" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR15_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR16_GSEL" acronym="CONTROLSS_INPUTXBAR16_GSEL" offset="1280" width="32" description="INPUT XBAR16 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR16_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR16_G0" acronym="CONTROLSS_INPUTXBAR16_G0" offset="1284" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR16_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR16_G1" acronym="CONTROLSS_INPUTXBAR16_G1" offset="1288" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR16_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR17_GSEL" acronym="CONTROLSS_INPUTXBAR17_GSEL" offset="1344" width="32" description="INPUT XBAR17 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR17_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR17_G0" acronym="CONTROLSS_INPUTXBAR17_G0" offset="1348" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR17_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR17_G1" acronym="CONTROLSS_INPUTXBAR17_G1" offset="1352" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR17_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR18_GSEL" acronym="CONTROLSS_INPUTXBAR18_GSEL" offset="1408" width="32" description="INPUT XBAR18 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR18_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR18_G0" acronym="CONTROLSS_INPUTXBAR18_G0" offset="1412" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR18_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR18_G1" acronym="CONTROLSS_INPUTXBAR18_G1" offset="1416" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR18_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR19_GSEL" acronym="CONTROLSS_INPUTXBAR19_GSEL" offset="1472" width="32" description="INPUT XBAR19 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR19_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR19_G0" acronym="CONTROLSS_INPUTXBAR19_G0" offset="1476" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR19_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR19_G1" acronym="CONTROLSS_INPUTXBAR19_G1" offset="1480" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR19_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR20_GSEL" acronym="CONTROLSS_INPUTXBAR20_GSEL" offset="1536" width="32" description="INPUT XBAR20 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR20_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR20_G0" acronym="CONTROLSS_INPUTXBAR20_G0" offset="1540" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR20_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR20_G1" acronym="CONTROLSS_INPUTXBAR20_G1" offset="1544" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR20_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR21_GSEL" acronym="CONTROLSS_INPUTXBAR21_GSEL" offset="1600" width="32" description="INPUT XBAR21 Input Select0 : GPI1: ICSS GPO port.">
		<bitfield id="INPUTXBAR21_GSEL_GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR21_G0" acronym="CONTROLSS_INPUTXBAR21_G0" offset="1604" width="32" description="Input GPI XBAR selection - valid inputs are GPI[143:0].">
		<bitfield id="INPUTXBAR21_G0_SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INPUTXBAR21_G1" acronym="CONTROLSS_INPUTXBAR21_G1" offset="1608" width="32" description="ICSS GPO port selection - ICSS GPO[31:0].">
		<bitfield id="INPUTXBAR21_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4:0" rwaccess="R/W"/>
